IDEA StatiCa Open Model
StrainImpulse Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The StrainImpulse type exposes the following members.
Properties
Name | Description
EpsX
 The normal strain.
GammaXY
 The shear strain.
GammaXZ
 The shear strain.
PhiX
 The torsion slope around x axis.
PhiY
 The curvature around z axis.
PhiZ
 The curvature around y axis.
Top
See Also
Reference
StrainImpulse Structure
IdeaRS.OpenModel.Loading Namespace